## Criando novas colunas

In [31]:
# Importando bibliotecas
import pandas as pd
import numpy as np

In [32]:
# Lendo a base de dados
df = pd.read_excel("Fortaleza.xlsx")

In [3]:
# Visualizando as 5 primeiras linhas
df.head()

      Cidade       Data  ValorProduto  LojaID  Qtde
0  Fortaleza 2018-01-01        142.00    1520     1
1  Fortaleza 2018-01-01         14.21    1522     6
2  Fortaleza 2018-01-01         71.55    1520     1
3  Fortaleza 2018-01-01          3.01    1521     7
4  Fortaleza 2018-01-01         24.51    1522     8

### Criando a coluna de receita

In [33]:
df["Receita"] = df["ValorProduto"] * df["Qtde"]

In [5]:
df.head()

      Cidade       Data  ValorProduto  LojaID  Qtde  Receita
0  Fortaleza 2018-01-01        142.00    1520     1   142.00
1  Fortaleza 2018-01-01         14.21    1522     6    85.26
2  Fortaleza 2018-01-01         71.55    1520     1    71.55
3  Fortaleza 2018-01-01          3.01    1521     7    21.07
4  Fortaleza 2018-01-01         24.51    1522     8   196.08

### Criando uma coluna com base em uma condição

### numpy.where(condição, valor_se_verdadeiro, valor_se_falso)

In [6]:
df["ClassificaçãoVenda"] = np.where(df["Receita"] > 1000, "Alta", "Baixa")

In [6]:
df.sample(10)

        Cidade       Data  ValorProduto  LojaID  Qtde  Receita
22   Fortaleza 2018-01-02        150.94    1522     1   150.94
79   Fortaleza 2018-01-01          5.59    1521     4    22.36
67   Fortaleza 2018-01-01         78.13    1521     4   312.52
89   Fortaleza 2018-01-01         10.15    1523     7    71.05
80   Fortaleza 2018-01-01        121.77    1523     3   365.31
98   Fortaleza 2018-01-01        138.33    1521    10  1383.30
24   Fortaleza 2018-01-02        151.04    1522     6   906.24
103  Fortaleza 2018-01-01         12.62    1522     3    37.86
16   Fortaleza 2018-01-02         37.68    1522    10   376.80
68   Fortaleza 2018-01-01        179.74    1520     2   359.48

In [34]:
def classificavenda(valor):
    if valor < 1000:
        return "Baixa"
    else:
        return "Alta"

In [35]:
df["ClassificaVenda1"] = df["Receita"].apply(classificavenda)

In [36]:
df.sample(4)

,Cidade,Data,ValorProduto,LojaID,Qtde,Receita,ClassificaVenda1
67,Fortaleza,2018-01-01,78.13,1521,4,312.52,Baixa
83,Fortaleza,2018-01-01,14.44,1520,5,72.20,Baixa
25,Fortaleza,2018-01-02,34.66,1521,8,277.28,Baixa
139,Fortaleza,2019-01-04,142.00,1522,3,426.00,Baixa

### uma função lambda é uma função sem nome que pode ser definida em uma única linha de código. Essas funções são úteis em situações em que precisamos definir uma função temporária ou simples que não precisa ser definida formalmente.

In [37]:
df['ClassificacaoVenda2'] = df['Receita'].apply(lambda x: 'Baixa' if x < 1000 else 'Alta')

In [38]:
df.sample(4)

,Cidade,Data,ValorProduto,LojaID,Qtde,Receita,ClassificaVenda1,ClassificacaoVenda2
26,Fortaleza,2018-01-02,6.98,1521,10,69.8,Baixa,Baixa
5,Fortaleza,2018-01-01,156.20,1522,1,156.2,Baixa,Baixa
83,Fortaleza,2018-01-01,14.44,1520,5,72.2,Baixa,Baixa
129,Fortaleza,2018-01-01,13.70,1522,6,82.2,Baixa,Baixa

### Várias condições

### numpy.select(condições, valores_possíveis, valor_default)

In [ ]:
condições = [
    df['Receita'].isnull(),
    df['Receita'] < 100,
    (df['Receita'] >= 100) & (df['Receita'] <= 500),
    df['Receita'] > 500
]

valores_possíveis = [
    'Nenhum',
    'Baixa',
    'Média',
    'Alta'
]

In [ ]:
df['ClassificacaoVenda'] = np.select(condições, valores_possíveis, default='Desconhecido')

In [ ]:
df.sample(10)